def solution(letter):
    morse = {
        '.-': 'a', '-...': 'b', '-.-.': 'c', '-..': 'd', '.': 'e', '..-.': 'f',
        '--.': 'g', '....': 'h', '..': 'i', '.---': 'j', '-.-': 'k', '.-..': 'l',
        '--': 'm', '-.': 'n', '---': 'o', '.--.': 'p', '--.-': 'q', '.-.': 'r',
        '...': 's', '-': 't', '..-': 'u', '...-': 'v', '.--': 'w', '-..-': 'x',
        '-.--': 'y', '--..': 'z'
    }
    
    # 공백 기준으로 모스 부호를 나누고, 변환 후 문자열 합치기
    # 파이썬 split()함수는 따로 값을 주지 않으면 공백을 기준으로 문자열을 나눈다.
    return "".join(morse[word] for word in letter.split())

# 테스트
print(solution(".... . .-.. .-.. ---"))  # "hello"
